<?php
// Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'.
$arr = [
    ['a', 'b', 'c'],
    ['d', 'e', 'f'],
    ['g', 'h', 'i'],
    ['j', 'k', 'l'],
];
echo $arr[3][2] . PHP_EOL;
echo $arr[1][1] . PHP_EOL;
echo $arr[2][0] . PHP_EOL;
echo $arr[0][0] . PHP_EOL;


// Найдите сумму всех его элементов.
$arr1 = [[1, 2], [3, 4], [5, 6]];
echo $arr1[0][0] + $arr1[0][1] + $arr1[1][0] + $arr1[1][1] + $arr1[2][0] + $arr1[2][1];


// Выведите с помощью этого массива имя первого мальчика и имя второй девочки.
$arr2 = [
    'boys'  => [1 => 'Коля', 2 => 'Вася', 3 => 'Петя'],
    'girls' => [1 => 'Даша', 2 => 'Маша', 3 => 'Лена'],
];
echo $arr2['boys'][1];
echo $arr2['girls'][2];