<?php
    // Создайте переменную $a. Запишите в нее сумму чисел 1, 2 и 3.
    // С помощью команды echo выведите на экран содержимое переменной $a.
    $a = 1 + 2 + 3;
    echo $a;

    // Создайте переменную $a со значением 10 и переменную $b со значением 2.
    // Выведите на экран их сумму, разность, произведение и частное (результат деления).
    $a1 = 10;
    $b1 = 2;
    echo $a1 + $b1;
    echo $a1 - $b1;
    echo $a1 * $b1;
    echo $a1 / $b1;

    // Создайте переменную $c со значением 10 и переменную $d со значением 5.
    // Просуммируйте их, а результат присвойте переменной $result. Выведите на экран значение переменной $result.
    $c2 = 10;
    $d = 5;
    $result = $c2 + $d;
    echo $result;

    // Создайте переменную $a со значением 1, переменную $b со значением 2 и переменную $c со значением 3.
    // Выведите на экран их сумму.
    $a3 = 1;
    $b3 = 2;
    $c3 = 3;
    echo $a3 + $b3 + $c3;