<?php
// Переделайте следующую структуру PHP в строку JSON:
$data = [1, 2, 3];
$data = '[1, 2, 3]';

// Переделайте следующую структуру PHP в строку JSON:
$data = ['x', 'y', 'z',];
$data = '["x", "y", "z"]';

// Переделайте следующую структуру PHP в строку JSON:
$data = [
    'x' => 'a',
    'y' => 'b',
    'z' => 'c',
];
$data = '[
    "x" => "a",
    "y" => "b",
    "z" => "c"
]';

// Переделайте следующую структуру PHP в строку JSON:
$data = [
    'ru' => ['1', '2', '3'],
    'en' => ['a', 'b', 'c'],
];
$data = '[
    "ru" => ["1", "2", "3"],
    "en" => ["a", "b", "c"]
]';