<?php
// С помощью тега <i> выведите на экран курсивный текст.
echo '<i> Hello World </i>';

// С помощью тега <br> выведите на экран столбец чисел от 1 до 9.
echo '1 <br> 2 <br> 3 <br> 4 <br> 5 <br> 6 <br> 7 <br> 8 <br> 9';

// С помощью тега <img> выведите на экран какую-нибудь картинку.
echo '<img src="img.jpg">';

// С помощью тега <input> выведите на экран инпут с каким-нибудь текстом.
echo '<input value="Hello World">';

// С помощью тега <textarea> выведите на экран многострочное поле ввода с каким-нибудь текстом.
echo '<textarea value="This is textarea">';