<?php
// С помощью цикла for выведите на экран числа от 1 до 100.
for ($i = 1; $i <= 100; $i++) {
    echo $i . PHP_EOL;
}

// С помощью цикла for выведите на экран числа от 11 до 33.
for ($i = 11; $i <= 33; $i++) {
    echo $i . PHP_EOL;
}

// С помощью цикла for выведите на экран четные числа в промежутке от 0 до 100.
for ($i = 0; $i <= 100; $i += 2) {
    echo $i . PHP_EOL;
}

// С помощью цикла for выведите на экран нечетные числа в промежутке от 1 до 99.
for ($i = 1; $i <= 99; $i += 2) {
    echo $i . PHP_EOL;
}

// С помощью цикла for выведите на экран числа от 100 до 0.
for ($i = 100; $i > 0; $i--) {
    echo $i . PHP_EOL;
}